Revit 2024 API
ComponentRepeaterSlot.IsDefault Property
 A flag indicating whether the slot currently holds an instance of the default family type of the component repeater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsDefault { get; }
Visual Basic
Public ReadOnly Property IsDefault As Boolean
	Get
Visual C++
public:
property bool IsDefault {
	bool get ();
}
See Also
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace